---
kind: property
id: P:Autodesk.Revit.DB.BaseImportOptions.CustomScale
source: html/eca4b856-2186-5203-0503-d6151e795241.htm
---
# Autodesk.Revit.DB.BaseImportOptions.CustomScale Property

Scaling the import.
 If this is defined and a valid value (> 0.0), it takes priority over units.

## Syntax (C#)
```csharp
public double CustomScale { get; set; }
```